/*
У Кости есть бумажка, на которой написано n чисел. Также у него есть возможность не больше, чем k раз, взять любое число с бумажки,
после чего закрасить одну из старых цифр, а на ее месте написать новую произвольную цифру.
На какое максимальное значение Костя сможет увеличить сумму всех чисел на листочке?

Формат входных данных
В первой строке входного файла даны два целых числа n,k — количество чисел на бумажке и ограничение на число операций (1 <= n <= 1000, 1 <= k <= 10^4).
Во второй строке записано n чисел ai — числа на бумажке (1 <= ai <= 10^9).

Формат выходных данных
В выходной файл выведите одно число — максимальную разность между конечной и начальной суммой.

Замечание
В первом примере Костя может изменить две единицы на две девятки, в результате чего сумма чисел увеличится на 16.
Во втором примере Костя меняет число 85 на 95.
В третьем примере можно ничего не менять.
Обратите внимание, что ответ может превышать вместимость 32-битного типа данных.

Примеры данных

Пример 1
ввод:
5  2
1  2  1  3  5
вывод:
16

Пример 2
ввод:
3  1
99  5  85
вывод:
10

Пример 3
ввод:
1  10
9999
вывод:
0
*/

